## Import et préparation des données

### Fusionnement des fichiers csv de chicago

In [2]:
import pandas as pd

df_chicago_daily = pd.read_csv('..\data\chicago_csv\chicago_ridership_daily.csv')
df_chicago_monthly=pd.read_csv('..\data\chicago_csv\chicago_ridership_monthly.csv')

In [3]:
df_chicago_daily.head()

         date route day_type  ridership
0  2001-01-03    44        W       5085
1  2001-01-03    80        W      10881
2  2001-01-04   152        W       8853
3  2001-01-03   56A        W        403
4  2001-01-03   119        W       3810

In [8]:
df_chicago_daily.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   date       500 non-null    object
 1   route      500 non-null    object
 2   day_type   500 non-null    object
 3   ridership  500 non-null    int64
dtypes: int64(1), object(3)
memory usage: 15.8+ KB

In [4]:
df_chicago_monthly.head()

,month_beginning,route,route_name,avg_weekday_rides,avg_saturday_rides,avg_sunday_holiday_rides,month_total
0,2001-02-01,125,Water Tower Express,2385.0,0.0,0.0,47699.0
1,2001-01-01,52,Kedzie/California,11592.4,8223.9,5112.6,313490.0
2,2001-04-01,18,16th/18th,1685.9,1003.6,732.2,43079.0
3,2001-02-01,100,Jeffery Manor Express,1177.7,0.0,0.0,23555.0
4,2001-01-01,27,South Deering,5629.5,2984.1,2423.6,147904.0

In [7]:
df_chicago_monthly.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 7 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   month_beginning           500 non-null    object
 1   route                     500 non-null    object
 2   route_name                500 non-null    object
 3   avg_weekday_rides         500 non-null    float64
 4   avg_saturday_rides        500 non-null    float64
 5   avg_sunday_holiday_rides  500 non-null    float64
 6   month_total               500 non-null    float64
dtypes: float64(4), object(3)
memory usage: 27.5+ KB

In [9]:
import pandas as pd

# Extraire l'année et le mois de df_chicago_daily
df_chicago_daily['date'] = pd.to_datetime(df_chicago_daily['date'])
df_chicago_daily['year_month'] = df_chicago_daily['date'].dt.to_period('M')

# Transformer month_beginning en année-mois
df_chicago_monthly['month_beginning'] = pd.to_datetime(df_chicago_monthly['month_beginning'])
df_chicago_monthly['year_month'] = df_chicago_monthly['month_beginning'].dt.to_period('M')

# Fusionner sur route et year_month
df_chicago = pd.merge(
    df_chicago_daily,
    df_chicago_monthly,
    how='left',
    left_on=['route', 'year_month'],
    right_on=['route', 'year_month']
)

# Vérifier le résultat
df_chicago.head()

,date,route,day_type,ridership,year_month,month_beginning,route_name,avg_weekday_rides,avg_saturday_rides,avg_sunday_holiday_rides,month_total
0,2001-01-03,44,W,5085,2001-01,2001-01-01,Wallace-Racine,6559.2,2696.0,1564.6,162910.0
1,2001-01-03,80,W,10881,2001-01,2001-01-01,Irving Park,11837.8,8077.1,5275.2,319117.0
2,2001-01-04,152,W,8853,2001-01,2001-01-01,Addison,10738.1,4457.2,2287.1,265503.0
3,2001-01-03,56A,W,403,2001-01,2001-01-01,North Milwaukee,568.5,0.0,0.0,11938.0
4,2001-01-03,119,W,3810,2001-01,2001-01-01,Michigan/119th,5171.2,4747.3,2890.1,147205.0

In [10]:
df_chicago.shape

(500, 11)

### Fusionnement des fichiers csv de Philadelphie

In [11]:
import pandas as pd

df_phil_mode = pd.read_csv('..\data\philadelphia_csv\Average_Daily_Ridership_By_Mode - City of Philadelphia.csv')
df_phil_route=pd.read_csv('..\data\philadelphia_csv\Average_Daily_Ridership_By_Route - City of Philadelphia.csv')

In [12]:
df_phil_mode.head()

,Calendar_Year,Calendar_Month,Mode,Average_Daily_Ridership,Source,ObjectId
0,2019,1,Bus,459160,APC,1
1,2019,1,CCT,4294,Revenue,2
2,2019,1,Heavy Rail,296709,Revenue,3
3,2019,1,Regional Rail,122856,Revenue,4
4,2019,1,Trackless Trolley,16853,APC,5

In [23]:
df_phil_mode.columns

Index(['Calendar_Year', 'Calendar_Month', 'Mode', 'Average_Daily_Ridership',
       'Source', 'ObjectId'],
      dtype='object')

In [13]:
df_phil_route.head()

,Calendar_Year,Calendar_Month,Route,Average_Daily_Ridership,Source,ObjectId
0,2019,8,59,3811,APC,2
1,2019,8,60,8550,APC,3
2,2019,8,61,3563,APC,4
3,2019,8,62,226,APC,5
4,2019,8,64,4335,APC,6

In [22]:
df_phil_route.columns

Index(['Calendar_Year', 'Calendar_Month', 'Route', 'Average_Daily_Ridership',
       'Source', 'ObjectId'],
      dtype='object')

In [20]:
df_phil = pd.merge(
    df_phil_route,
    df_phil_mode,
    how='inner',
    on=['Calendar_Year', 'Calendar_Month']
)

In [21]:
df_phil.head()

,Calendar_Year,Calendar_Month,Route,Average_Daily_Ridership_x,Source_x,ObjectId_x,Mode,Average_Daily_Ridership_y,Source_y,ObjectId_y
0,2019,8,59,3811,APC,2,Bus,406865,APC,43
1,2019,8,59,3811,APC,2,CCT,5649,Revenue,44
2,2019,8,59,3811,APC,2,Heavy Rail,268150,Revenue,45
3,2019,8,59,3811,APC,2,Regional Rail,114436,Revenue,46
4,2019,8,59,3811,APC,2,Trackless Trolley,15313,APC,47

### Appel d'api de CTA Bus Tracker (Chicago)

In [ ]:
import requests
import pandas as pd

CTA_API_KEY = "VOTRE_CLE_API"  # Remplacez par votre clé
CTA_BASE_URL = "https://www.ctabustracker.com/bustime/api/v3"

def  get_cta_routes(api_key):
    params = {"key": api_key, "format": "json"}
    response = requests.get(f"{CTA_BASE_URL}/getroutes", params=params)
    data = response.json().get("bustime-response", {}).get("routes", [])
    return pd.DataFrame(data)